title: AnyDesk Installation
id: 563eb024-a435-47ae-b2f5-902585e0beb3
status: experimental
description: AnyDesk Remote Desktop installation can be used by attacker to gain remote access
author: Daniel Edwards
date: 2023/02/10
references: 
    - https://twitter.com/TheDFIRReport/status/1423361119926816776?s=20
tags:
    - attack.command_and_control
    - attack.t1219
logsource:
    category: process_creation
    product: windows
detection: 
    selection:
        CommandLine|contains|all:
            - '--install'
            - '--start-with-win'
        CurrentDirectory|contains:
            - 'C:\ProgamData\AnyDesk.exe'
    condition: selection
falsepositives: 
    - Legitimate deployment of AnyDesk
level: high
