title: PsExec Command Execution
id: 7850910a-fba5-4102-998e-83fe95831869
status: experimental
description: Detects the PSExec command execution from remote/destination host
author: Daniel Edwards
date: 2023/02/11
modified: 2023/02/13
references: 
    - https://threatexpress.com/redteaming/tool_ioc/psexec/
    - https://attack.mitre.org/techniques/T1569/002/
    - https://jpcertcc.github.io/ToolAnalysisResultSheet/#
tags:
    - attack.command_and_control
    - attack.t1569.002
    - attack.s0029
# Sysmon Process Creation
logsource: 
    category: process_creation
    product: windows
    service: sysmon
detection:
    selection1:
        EventID: 1
        ParentCommmandLine|contains: 'C:\Windows\system32\services.exe'
        CommandLine|contains: 'ps.exe -accepteula'
        Image|contains: 'C:\Windows\PSEXESVC.exe'
        Use|contains: 'NT AUTHORITY\SYSTEM'
    condition: selection
falsepositives: 
    - Could be a legit use of PSEXEC
level: medium
   
