title: PsExec Command Execution
id: 7850910a-fba5-4102-998e-83fe95831869
status: experimental
description: Detects the PSExec command execution from remote/destination host
author: Daniel Edwards
date: 2023/02/11
references: 
    - https://threatexpress.com/redteaming/tool_ioc/psexec/
    - https://attack.mitre.org/techniques/T1569/002/
    - https://jpcertcc.github.io/ToolAnalysisResultSheet/#
tags:
    - attack.command_and_control
    - attack.t1569.002
    - attack.s0029
# Sysmon Process Creation
logsource: 
    category: process_creation
    product: windows
    service: sysmon
detection:
    selection1:
        EventID: 1
        Commmandline|contains: 'C:\Windows\system32\services.exe'
        Image|contains: 'C:\Windows\PSEXESVC.exe'
        Use|contains: 'NT AUTHORITY\SYSTEM'
    condition: selection1
    
# Service Installation
logsource:
     category: service_install
     product: windows
     service: system
detection:
    selection2:
        EventID: 7045
        ServiceName|contains: 'PSEXESVC'
        ServiceFileName|contains: '%SystemRoot%\PSEXESVC.exe'
        ServiceAccount|contains: 'LocalSystem'
    condition: selection2

falsepositives: 
    - Could be a legit use of PSEXEC
    
level: medium
   
