title: Windows OpenSSH Lateral Movement Detection
id: generate one here https://www.uuidgenerator.net/version4
status: experimental
description: A description of what your rule is meant to detect 
references:
    - A list of all references that can help a reader or analyst understand the meaning of a triggered rule
tags:
    - attack.lateral_movement  # example MITRE ATT&CK category
    - attack.t1021.004      # example MITRE ATT&CK technique id
    - car.2014-04-003   # example CAR id
author: Daniel Edwards  # example, a list of authors
date: 2023/01/0  # Rule date
logsource:                      # important for the field mapping in predefined or your additional config files
    category: process_creation  # In this example we choose the category 'process_creation'
    product: windows            # the respective product
detection:
    selection:
        EventID: 4
        FieldName: IntegerValue
        FieldName|modifier: 'Value'
    condition: selection
fields:
    - fields in the log source that are important to investigate further
falsepositives:
    - describe possible false positive conditions to help the analysts in their investigation
level: one of five levels (informational, low, medium, high, critical)
